; domain
(define (domain Depot)
;(:requirements :typing :fluents)
(:types place locatable - object
		depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface)
)

(:functions 
	(load_limit ?t - truck) 
	(current_load ?t - truck) 
	(weight ?c - crate)
	(fuel-cost)
)
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)
		(increase (fuel-cost) 10)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z)) (increase (fuel-cost) 1)))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y)
		(<= (+ (current_load ?z) (weight ?y)) (load_limit ?z)))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)
		(increase (current_load ?z) (weight ?y))))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)
		(decrease (current_load ?z) (weight ?y))))

)

; problem
(define (problem depotprob77) (:domain depot)
(:objects
	depot0 depot1 depot2 - depot
	distributor0 distributor1 distributor2 - distributor
	truck0 truck1 - truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 - pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 - crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 - hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate5)
	(at pallet2 depot2)
	(clear crate2)
	(at pallet3 distributor0)
	(clear crate6)
	(at pallet4 distributor1)
	(clear crate9)
	(at pallet5 distributor2)
	(clear pallet5)
	(at pallet6 distributor2)
	(clear pallet6)
	(at pallet7 distributor1)
	(clear pallet7)
	(at pallet8 distributor2)
	(clear pallet8)
	(at pallet9 distributor1)
	(clear crate12)
	(at pallet10 depot2)
	(clear crate11)
	(at pallet11 depot0)
	(clear pallet11)
	(at pallet12 distributor1)
	(clear pallet12)
	(at pallet13 distributor2)
	(clear crate8)
	(at truck0 depot0)
	(= (current_load truck0) 0)
	(= (load_limit truck0) 299)
	(at truck1 depot0)
	(= (current_load truck1) 0)
	(= (load_limit truck1) 301)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 distributor0)
	(available hoist3)
	(at hoist4 distributor1)
	(available hoist4)
	(at hoist5 distributor2)
	(available hoist5)
	(at hoist6 distributor1)
	(available hoist6)
	(at crate0 distributor0)
	(on crate0 pallet3)
	(= (weight crate0) 22)
	(at crate1 distributor0)
	(on crate1 crate0)
	(= (weight crate1) 6)
	(at crate2 depot2)
	(on crate2 pallet2)
	(= (weight crate2) 60)
	(at crate3 distributor1)
	(on crate3 pallet4)
	(= (weight crate3) 12)
	(at crate4 distributor0)
	(on crate4 crate1)
	(= (weight crate4) 68)
	(at crate5 depot1)
	(on crate5 pallet1)
	(= (weight crate5) 35)
	(at crate6 distributor0)
	(on crate6 crate4)
	(= (weight crate6) 96)
	(at crate7 distributor1)
	(on crate7 pallet9)
	(= (weight crate7) 12)
	(at crate8 distributor2)
	(on crate8 pallet13)
	(= (weight crate8) 80)
	(at crate9 distributor1)
	(on crate9 crate3)
	(= (weight crate9) 92)
	(at crate10 depot2)
	(on crate10 pallet10)
	(= (weight crate10) 81)
	(at crate11 depot2)
	(on crate11 crate10)
	(= (weight crate11) 68)
	(at crate12 distributor1)
	(on crate12 crate7)
	(= (weight crate12) 47)
	(= (fuel-cost) 0)
)

(:goal (and
		(on crate0 pallet4)
		(on crate1 crate2)
		(on crate2 pallet2)
		(on crate3 pallet0)
		(on crate4 pallet10)
		(on crate5 crate6)
		(on crate6 pallet12)
		(on crate7 crate10)
		(on crate8 pallet9)
		(on crate9 pallet3)
		(on crate10 pallet13)
		(on crate11 pallet1)
		(on crate12 crate9)
	)
)

(:metric minimize (total-time)))

; plan
1. (lift hoist6 crate12 crate7 distributor1)
   deleted: (at crate12 distributor1) (clear crate12) (available hoist6) (on crate12 crate7)
   added: (lifting hoist6 crate12) (clear crate7)
   changed: (fuel-cost) from 0 to 1
   goals met: 1 of 13
2. (lift hoist1 crate5 pallet1 depot1)
   deleted: (at crate5 depot1) (clear crate5) (available hoist1) (on crate5 pallet1)
   added: (lifting hoist1 crate5) (clear pallet1)
   changed: (fuel-cost) from 1 to 2
   goals met: 1 of 13
3. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 2 to 12
   goals met: 1 of 13
4. (load hoist1 crate5 truck0 depot1)
   deleted: (lifting hoist1 crate5)
   added: (in crate5 truck0) (available hoist1)
   changed: (current_load truck0) from 0 to 35
   goals met: 1 of 13
5. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 12 to 22
   goals met: 1 of 13
6. (unload hoist3 crate5 truck0 distributor0)
   deleted: (in crate5 truck0) (available hoist3)
   added: (lifting hoist3 crate5)
   changed: (current_load truck0) from 35 to 0
   goals met: 1 of 13
7. (lift hoist4 crate7 pallet9 distributor1)
   deleted: (at crate7 distributor1) (clear crate7) (available hoist4) (on crate7 pallet9)
   added: (lifting hoist4 crate7) (clear pallet9)
   changed: (fuel-cost) from 22 to 23
   goals met: 1 of 13
8. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 23 to 33
   goals met: 1 of 13
9. (load hoist4 crate7 truck0 distributor1)
   deleted: (lifting hoist4 crate7)
   added: (in crate7 truck0) (available hoist4)
   changed: (current_load truck0) from 0 to 12
   goals met: 1 of 13
10. (lift hoist5 crate8 pallet13 distributor2)
   deleted: (at crate8 distributor2) (clear crate8) (available hoist5) (on crate8 pallet13)
   added: (lifting hoist5 crate8) (clear pallet13)
   changed: (fuel-cost) from 33 to 34
   goals met: 1 of 13
11. (drive truck0 distributor1 distributor2)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 34 to 44
   goals met: 1 of 13
12. (load hoist5 crate8 truck0 distributor2)
   deleted: (lifting hoist5 crate8)
   added: (in crate8 truck0) (available hoist5)
   changed: (current_load truck0) from 12 to 92
   goals met: 1 of 13
13. (drive truck0 distributor2 distributor1)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 44 to 54
   goals met: 1 of 13
14. (unload hoist4 crate8 truck0 distributor1)
   deleted: (in crate8 truck0) (available hoist4)
   added: (lifting hoist4 crate8)
   changed: (current_load truck0) from 92 to 12
   goals met: 1 of 13
15. (drop hoist4 crate8 pallet9 distributor1)
   deleted: (lifting hoist4 crate8) (clear pallet9)
   added: (available hoist4) (at crate8 distributor1) (clear crate8) (on crate8 pallet9)
   goals met: 2 of 13
16. (lift hoist2 crate11 crate10 depot2)
   deleted: (at crate11 depot2) (clear crate11) (available hoist2) (on crate11 crate10)
   added: (lifting hoist2 crate11) (clear crate10)
   changed: (fuel-cost) from 54 to 55
   goals met: 2 of 13
17. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 55 to 65
   goals met: 2 of 13
18. (load hoist2 crate11 truck0 depot2)
   deleted: (lifting hoist2 crate11)
   added: (in crate11 truck0) (available hoist2)
   changed: (current_load truck0) from 12 to 80
   goals met: 2 of 13
19. (unload hoist2 crate7 truck0 depot2)
   deleted: (in crate7 truck0) (available hoist2)
   added: (lifting hoist2 crate7)
   changed: (current_load truck0) from 80 to 68
   goals met: 2 of 13
20. (drive truck0 depot2 depot1)
   deleted: (at truck0 depot2)
   added: (at truck0 depot1)
   changed: (fuel-cost) from 65 to 75
   goals met: 2 of 13
21. (unload hoist1 crate11 truck0 depot1)
   deleted: (in crate11 truck0) (available hoist1)
   added: (lifting hoist1 crate11)
   changed: (current_load truck0) from 68 to 0
   goals met: 2 of 13
22. (drive truck0 depot1 depot0)
   deleted: (at truck0 depot1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 75 to 85
   goals met: 2 of 13
23. (drop hoist1 crate11 pallet1 depot1)
   deleted: (lifting hoist1 crate11) (clear pallet1)
   added: (available hoist1) (at crate11 depot1) (clear crate11) (on crate11 pallet1)
   goals met: 3 of 13
24. (lift hoist4 crate9 crate3 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist4) (on crate9 crate3)
   added: (lifting hoist4 crate9) (clear crate3)
   changed: (fuel-cost) from 85 to 86
   goals met: 3 of 13
25. (drop hoist4 crate9 crate8 distributor1)
   deleted: (lifting hoist4 crate9) (clear crate8)
   added: (available hoist4) (at crate9 distributor1) (clear crate9) (on crate9 crate8)
   goals met: 3 of 13
26. (drop hoist6 crate12 crate9 distributor1)
   deleted: (lifting hoist6 crate12) (clear crate9)
   added: (available hoist6) (at crate12 distributor1) (clear crate12) (on crate12 crate9)
   goals met: 4 of 13
27. (lift hoist6 crate3 pallet4 distributor1)
   deleted: (at crate3 distributor1) (clear crate3) (available hoist6) (on crate3 pallet4)
   added: (lifting hoist6 crate3) (clear pallet4)
   changed: (fuel-cost) from 86 to 87
   goals met: 4 of 13
28. (drive truck0 depot0 distributor1)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 87 to 97
   goals met: 4 of 13
29. (load hoist6 crate3 truck0 distributor1)
   deleted: (lifting hoist6 crate3)
   added: (in crate3 truck0) (available hoist6)
   changed: (current_load truck0) from 0 to 12
   goals met: 4 of 13
30. (drive truck0 distributor1 depot0)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot0)
   changed: (fuel-cost) from 97 to 107
   goals met: 4 of 13
31. (unload hoist0 crate3 truck0 depot0)
   deleted: (in crate3 truck0) (available hoist0)
   added: (lifting hoist0 crate3)
   changed: (current_load truck0) from 12 to 0
   goals met: 4 of 13
32. (drive truck0 depot0 distributor2)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 107 to 117
   goals met: 4 of 13
33. (drop hoist0 crate3 pallet0 depot0)
   deleted: (lifting hoist0 crate3) (clear pallet0)
   added: (available hoist0) (at crate3 depot0) (clear crate3) (on crate3 pallet0)
   goals met: 5 of 13
34. (drive truck0 distributor2 distributor0)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 117 to 127
   goals met: 5 of 13
35. (load hoist3 crate5 truck0 distributor0)
   deleted: (lifting hoist3 crate5)
   added: (in crate5 truck0) (available hoist3)
   changed: (current_load truck0) from 0 to 35
   goals met: 5 of 13
36. (lift hoist3 crate6 crate4 distributor0)
   deleted: (at crate6 distributor0) (clear crate6) (available hoist3) (on crate6 crate4)
   added: (lifting hoist3 crate6) (clear crate4)
   changed: (fuel-cost) from 127 to 128
   goals met: 5 of 13
37. (load hoist3 crate6 truck0 distributor0)
   deleted: (lifting hoist3 crate6)
   added: (in crate6 truck0) (available hoist3)
   changed: (current_load truck0) from 35 to 131
   goals met: 5 of 13
38. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 128 to 138
   goals met: 5 of 13
39. (unload hoist4 crate6 truck0 distributor1)
   deleted: (in crate6 truck0) (available hoist4)
   added: (lifting hoist4 crate6)
   changed: (current_load truck0) from 131 to 35
   goals met: 5 of 13
40. (drop hoist4 crate6 pallet12 distributor1)
   deleted: (lifting hoist4 crate6) (clear pallet12)
   added: (available hoist4) (at crate6 distributor1) (clear crate6) (on crate6 pallet12)
   goals met: 6 of 13
41. (unload hoist6 crate5 truck0 distributor1)
   deleted: (in crate5 truck0) (available hoist6)
   added: (lifting hoist6 crate5)
   changed: (current_load truck0) from 35 to 0
   goals met: 6 of 13
42. (drop hoist6 crate5 crate6 distributor1)
   deleted: (lifting hoist6 crate5) (clear crate6)
   added: (available hoist6) (at crate5 distributor1) (clear crate5) (on crate5 crate6)
   goals met: 7 of 13
43. (lift hoist3 crate4 crate1 distributor0)
   deleted: (at crate4 distributor0) (clear crate4) (available hoist3) (on crate4 crate1)
   added: (lifting hoist3 crate4) (clear crate1)
   changed: (fuel-cost) from 138 to 139
   goals met: 7 of 13
44. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 139 to 149
   goals met: 7 of 13
45. (load hoist3 crate4 truck0 distributor0)
   deleted: (lifting hoist3 crate4)
   added: (in crate4 truck0) (available hoist3)
   changed: (current_load truck0) from 0 to 68
   goals met: 7 of 13
46. (lift hoist3 crate1 crate0 distributor0)
   deleted: (at crate1 distributor0) (clear crate1) (available hoist3) (on crate1 crate0)
   added: (lifting hoist3 crate1) (clear crate0)
   changed: (fuel-cost) from 149 to 150
   goals met: 7 of 13
47. (load hoist3 crate1 truck0 distributor0)
   deleted: (lifting hoist3 crate1)
   added: (in crate1 truck0) (available hoist3)
   changed: (current_load truck0) from 68 to 74
   goals met: 7 of 13
48. (lift hoist3 crate0 pallet3 distributor0)
   deleted: (at crate0 distributor0) (clear crate0) (available hoist3) (on crate0 pallet3)
   added: (lifting hoist3 crate0) (clear pallet3)
   changed: (fuel-cost) from 150 to 151
   goals met: 7 of 13
49. (load hoist3 crate0 truck0 distributor0)
   deleted: (lifting hoist3 crate0)
   added: (in crate0 truck0) (available hoist3)
   changed: (current_load truck0) from 74 to 96
   goals met: 7 of 13
50. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 151 to 161
   goals met: 7 of 13
51. (unload hoist4 crate0 truck0 distributor1)
   deleted: (in crate0 truck0) (available hoist4)
   added: (lifting hoist4 crate0)
   changed: (current_load truck0) from 96 to 74
   goals met: 7 of 13
52. (drop hoist4 crate0 pallet4 distributor1)
   deleted: (lifting hoist4 crate0) (clear pallet4)
   added: (available hoist4) (at crate0 distributor1) (clear crate0) (on crate0 pallet4)
   goals met: 8 of 13
53. (drop hoist2 crate7 crate10 depot2)
   deleted: (lifting hoist2 crate7) (clear crate10)
   added: (available hoist2) (at crate7 depot2) (clear crate7) (on crate7 crate10)
   goals met: 9 of 13
54. (drive truck0 distributor1 depot2)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 161 to 171
   goals met: 9 of 13
55. (unload hoist2 crate1 truck0 depot2)
   deleted: (in crate1 truck0) (available hoist2)
   added: (lifting hoist2 crate1)
   changed: (current_load truck0) from 74 to 68
   goals met: 9 of 13
56. (drop hoist2 crate1 crate2 depot2)
   deleted: (lifting hoist2 crate1) (clear crate2)
   added: (available hoist2) (at crate1 depot2) (clear crate1) (on crate1 crate2)
   goals met: 10 of 13
57. (lift hoist2 crate7 crate10 depot2)
   deleted: (at crate7 depot2) (clear crate7) (available hoist2) (on crate7 crate10)
   added: (lifting hoist2 crate7) (clear crate10)
   changed: (fuel-cost) from 171 to 172
   goals met: 9 of 13
58. (load hoist2 crate7 truck0 depot2)
   deleted: (lifting hoist2 crate7)
   added: (in crate7 truck0) (available hoist2)
   changed: (current_load truck0) from 68 to 80
   goals met: 9 of 13
59. (lift hoist2 crate10 pallet10 depot2)
   deleted: (at crate10 depot2) (clear crate10) (available hoist2) (on crate10 pallet10)
   added: (lifting hoist2 crate10) (clear pallet10)
   changed: (fuel-cost) from 172 to 173
   goals met: 9 of 13
60. (load hoist2 crate10 truck0 depot2)
   deleted: (lifting hoist2 crate10)
   added: (in crate10 truck0) (available hoist2)
   changed: (current_load truck0) from 80 to 161
   goals met: 9 of 13
61. (drive truck0 depot2 distributor2)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor2)
   changed: (fuel-cost) from 173 to 183
   goals met: 9 of 13
62. (unload hoist5 crate10 truck0 distributor2)
   deleted: (in crate10 truck0) (available hoist5)
   added: (lifting hoist5 crate10)
   changed: (current_load truck0) from 161 to 80
   goals met: 9 of 13
63. (drop hoist5 crate10 pallet13 distributor2)
   deleted: (lifting hoist5 crate10) (clear pallet13)
   added: (available hoist5) (at crate10 distributor2) (clear crate10) (on crate10 pallet13)
   goals met: 10 of 13
64. (unload hoist5 crate7 truck0 distributor2)
   deleted: (in crate7 truck0) (available hoist5)
   added: (lifting hoist5 crate7)
   changed: (current_load truck0) from 80 to 68
   goals met: 10 of 13
65. (drive truck0 distributor2 depot2)
   deleted: (at truck0 distributor2)
   added: (at truck0 depot2)
   changed: (fuel-cost) from 183 to 193
   goals met: 10 of 13
66. (unload hoist2 crate4 truck0 depot2)
   deleted: (in crate4 truck0) (available hoist2)
   added: (lifting hoist2 crate4)
   changed: (current_load truck0) from 68 to 0
   goals met: 10 of 13
67. (drive truck0 depot2 distributor1)
   deleted: (at truck0 depot2)
   added: (at truck0 distributor1)
   changed: (fuel-cost) from 193 to 203
   goals met: 10 of 13
68. (drop hoist2 crate4 pallet10 depot2)
   deleted: (lifting hoist2 crate4) (clear pallet10)
   added: (available hoist2) (at crate4 depot2) (clear crate4) (on crate4 pallet10)
   goals met: 11 of 13
69. (drop hoist5 crate7 crate10 distributor2)
   deleted: (lifting hoist5 crate7) (clear crate10)
   added: (available hoist5) (at crate7 distributor2) (clear crate7) (on crate7 crate10)
   goals met: 12 of 13
70. (lift hoist6 crate12 crate9 distributor1)
   deleted: (at crate12 distributor1) (clear crate12) (available hoist6) (on crate12 crate9)
   added: (lifting hoist6 crate12) (clear crate9)
   changed: (fuel-cost) from 203 to 204
   goals met: 11 of 13
71. (lift hoist4 crate9 crate8 distributor1)
   deleted: (at crate9 distributor1) (clear crate9) (available hoist4) (on crate9 crate8)
   added: (lifting hoist4 crate9) (clear crate8)
   changed: (fuel-cost) from 204 to 205
   goals met: 11 of 13
72. (load hoist4 crate9 truck0 distributor1)
   deleted: (lifting hoist4 crate9)
   added: (in crate9 truck0) (available hoist4)
   changed: (current_load truck0) from 0 to 92
   goals met: 11 of 13
73. (load hoist6 crate12 truck0 distributor1)
   deleted: (lifting hoist6 crate12)
   added: (in crate12 truck0) (available hoist6)
   changed: (current_load truck0) from 92 to 139
   goals met: 11 of 13
74. (drive truck0 distributor1 distributor0)
   deleted: (at truck0 distributor1)
   added: (at truck0 distributor0)
   changed: (fuel-cost) from 205 to 215
   goals met: 11 of 13
75. (unload hoist3 crate9 truck0 distributor0)
   deleted: (in crate9 truck0) (available hoist3)
   added: (lifting hoist3 crate9)
   changed: (current_load truck0) from 139 to 47
   goals met: 11 of 13
76. (drop hoist3 crate9 pallet3 distributor0)
   deleted: (lifting hoist3 crate9) (clear pallet3)
   added: (available hoist3) (at crate9 distributor0) (clear crate9) (on crate9 pallet3)
   goals met: 12 of 13
77. (unload hoist3 crate12 truck0 distributor0)
   deleted: (in crate12 truck0) (available hoist3)
   added: (lifting hoist3 crate12)
   changed: (current_load truck0) from 47 to 0
   goals met: 12 of 13
78. (drop hoist3 crate12 crate9 distributor0)
   deleted: (lifting hoist3 crate12) (clear crate9)
   added: (available hoist3) (at crate12 distributor0) (clear crate12) (on crate12 crate9)
   goals met: 13 of 13
